[
  {
    "version": "1.5.0",
    "date": "2025-09-7",
    "changes": [
      "Refactored Service form view",
      "Refactored Service form presenter",
      "Refactored presenter in Services tab",
      "Refactored view in Services tab",
      "Changed fonts in Service tab to 'Verdana'",
      "Added translations to Service tab and all sub-forms"
    ]
  },
  {
    "version": "1.4.0",
    "date": "2025-08-28",
    "changes": [
      "Added material types dictionary button in Warehouse tab",
      "Added new material type dictionary management form",
      "Deleted from creating material form the option to add new material type",
      "Changed fonts in Warehouse tab to 'Verdana'",
      "Added translations to Warehouse tab and all sub-forms"
    ]
  },
  {
    "version": "1.3.0",
    "date": "2025-08-16",
    "changes": [
      "Enhanced login form security: Added secure database connection handling when the user is not authenticated through Azure.",
      "Implemented automatic database re-initializer (auto-awakener) on login form startup if the database service is inactive.",
      "Integrated detailed error reporting within the login form.",
      "Standardized font to 'Verdana' in the login form.",
      "Added multilingual translation support for the login form.",
      "Added generic repository method `GetAllAsync` to asynchronously retrieve all entities of the specified type, with optional query customization."
    ]
  },
  {
    "version": "1.2.0",
    "date": "2025-08-15",
    "changes": [
      "Refactored user creation form to capture and assign additional user attributes during account creation.",
      "Removed default Car Repair Shop configuration from the settings tab.",
      "Standardized font to 'Verdana' in the users tab and all related sub-forms."
    ]
  },
  {
    "version": "1.1.0",
    "date": "2025-08-12",
    "changes": [
      "Migrated local database to Azure SQL Database.",
      "Implemented centralized database connection handler.",
      "Integrated Azure Key Vault for secure storage of connection strings accessible to authorized group members.",
      "Added multilingual translation support for the main form UI.",
      "Added multilingual translation support for the users tab."
    ]
  },
  {
    "version": "1.0.0",
    "date": "2025-08-10",
    "changes": [
      "Introduced application changelog file.",
      "Added new 'Home' tab in the main interface.",
      "Integrated embedded web browser handler.",
      "Added current user session/context handler.",
      "Created dedicated 'Texts' project for centralized storage of UI texts and labels.",
      "Created 'Library' project to enable consistent text assignments across UI components."
    ]
  }
]