Repository: Gallileusz/CarRepairShop
Catalog: CarRepairShopTexts/SharedResources/texts.*.resx
Languages: pl_pl

# HomeTabAcknowledgements
source: I wish to express my deepest gratitude to my Supervisor, Dr. Wiktoria Kalus, for her invaluable support, kindness, and profoundly insightful guidance throughout the realization of this engineering thesis. Her scholarly expertise, dedication, and patience were of fundamental importance to the successful completion of this endeavor. I also extend my sincere appreciation to the entire RSâ€‘Code team for fostering a professional environment and for providing inspiring support, which significantly contributed to the development of my programming skills and to the enhancement of my practical knowledge in the field of software engineering. I am equally grateful to my family and friends for their unwavering patience, understanding, and emotional support, without which the completion of this project would not have been possible. The finalization of this thesis also marks the culmination of my studies and the conclusion of an important chapter in my academic journey, while at the same time opening the door to new professional challenges.
pl_pl: Pragnę wyrazić najgłębszą wdzięczność mojej Promotorce, dr Wiktorii Kalus, za jej nieocenione wsparcie, życzliwość oraz niezwykle cenne wskazówki, które udzielała mi na każdym etapie realizacji niniejszej pracy inżynierskiej. Jej wiedza merytoryczna, zaangażowanie i cierpliwość miały fundamentalne znaczenie dla powodzenia tego przedsięwzięcia. Serdeczne podziękowania kieruję również do całego zespołu RS‑Code za stworzenie profesjonalnej atmosfery, jak również za inspirujące wsparcie, które umożliwiło mi rozwój umiejętności programistycznych oraz pogłębienie wiedzy praktycznej w zakresie inżynierii oprogramowania. Na szczególne wyrazy wdzięczności zasługują także moi najbliżsi – rodzina i przyjaciele – którzy nieprzerwanie okazywali mi cierpliwość, zrozumienie oraz wsparcie emocjonalne, dzięki czemu możliwe stało się sfinalizowanie niniejszego projektu. Zwieńczenie tej pracy stanowi również symboliczne zakończenie okresu studiów i tym samym zamknięcie ważnego etapu w mojej drodze akademickiej, stanowiąc jednocześnie początek nowych wyzwań zawodowych.

# HomeTabAboutThisProject
source: Technology: The application was developed using the Windows Forms framework, enabling the creation of intuitive and user-friendly graphical interfaces for the Windows operating system. This technology provides a robust foundation for building desktop applications, ensuring both high performance and stability. Programming Language: The solution was implemented in C#, a versatile programming language offering extensive libraries, frameworks, and development tools, which efficiently support business application development as well as integration with various external services. MVP Architecture: The system follows the Model-View-Presenter (MVP) architectural pattern, which introduces a clear separation between business logic and the presentation layer. This design significantly improves maintainability, facilitates modifications, and allows functionality to be extended without affecting other components of the application. As a result, the codebase remains modular, organized, and adaptable to change. Testability: All business logic within the system has been covered with unit tests, which makes it possible to verify all use cases comprehensively. This approach enables early detection of defects, ensures a high level of code quality, and contributes to the overall reliability of the system. Database: Application data is stored in a relational SQL database hosted in Microsoft Azure. This solution provides secure storage, scalability, and guaranteed availability, allowing users to access the system seamlessly, regardless of their location. Application Features: - Registration and browsing of vehicles, clients, workshop orders, and services. - Editing and deletion of existing entries. - Data synchronization combined with secure access through authentication and authorization mechanisms.
pl_pl: Technologia: Aplikacja została opracowana w oparciu o platformę Windows Forms, co umożliwia tworzenie intuicyjnych i funkcjonalnych interfejsów graficznych dla systemu operacyjnego Windows. Wykorzystanie tej technologii pozwoliło na implementację klasycznego, ale wciąż popularnego modelu budowy aplikacji desktopowych, zapewniając jednocześnie stabilność oraz wysoką wydajność działania. Język programowania: Do implementacji całego rozwiązania wykorzystano język C#, którego bogate możliwości wraz z rozbudowanym ekosystemem bibliotek i narzędzi wspierają zarówno rozwój aplikacji biznesowych, jak i integrację z różnymi usługami zewnętrznymi. Architektura MVP: Aplikacja została zaprojektowana zgodnie z wzorcem architektonicznym Model-View-Presenter (MVP). Zapewnia on wyraźne rozdzielenie logiki biznesowej od warstwy prezentacji, co znacząco ułatwia utrzymanie kodu, wprowadzanie modyfikacji oraz rozszerzanie funkcjonalności bez ingerencji w pozostałe komponenty systemu. Tego rodzaju podejście wspiera czytelność i modularność kodu, a także zwiększa odporność aplikacji na zmiany. Testowalność: Cała logika biznesowa systemu została objęta testami jednostkowymi, dzięki czemu możliwe jest weryfikowanie wszystkich przypadków użycia oraz eliminowanie ewentualnych błędów na wczesnym etapie. Takie podejście gwarantuje utrzymanie wysokiej jakości kodu oraz zwiększa niezawodność całej aplikacji. Baza danych: Dane aplikacji są przechowywane w relacyjnej bazie danych SQL hostowanej w chmurze Microsoft Azure. Taka architektura zapewnia pełną dostępność oraz bezpieczeństwo danych, jak również elastyczną skalowalność, umożliwiającą korzystanie z systemu bez względu na lokalizację użytkownika. Funkcjonalności aplikacji: - Rejestracja oraz przeglądanie pojazdów, klientów, zleceń i usług warsztatowych. - Możliwość edycji i usuwania istniejących wpisów w bazie. - Synchronizacja danych oraz bezpieczny dostęp realizowany poprzez mechanizmy uwierzytelniania i autoryzacji.

# HomeTabSources
source: Sources: - Icons: https://icons8.com/
pl_pl: Źródła: - Icons: https://icons8.com/

# HomeTabChangelogLoadFailed
source: Missing changelog entries or changelog file coulnd't be found.
pl_pl: Brak wpisów w dzienniku zmian lub plik dziennika zmian nie został odnaleziony.

# HomeTabGitHubLoadFailed
source: Failed to open GitHub page. URL might be outdated or you have internet connection issues.
pl_pl: Nie udało się otworzyć strony GitHub. Adres URL może być nieaktualny lub występują problemy z połączeniem internetowym.

# LoginForm_ConnectionCancelled
source: Database connection has been cancelled!
pl_pl: Połączenie z bazą danych zostało anulowane!

# ContractorsTab_BrandNameColumn
source: Brand
pl_pl: Marka

# ContractorsTab_LicensePlateColumn
source: License plate
pl_pl: Rejestracja

# ContractorsTab_FuelTypeColumn
source: Fuel type
pl_pl: Typ paliwa

# ContractorsTab_MileageColumn
source: Mileage
pl_pl: Przebieg

# ContractorsTab_ProductionYearColumn
source: Production year
pl_pl: Rok produkcji

# ContractorsTab_EngineCapacityColumn
source: Engine capacity
pl_pl: Pojemność silnika

# ContractorsTab_ContractorNameColumn
source: Name
pl_pl: Imię

# ContractorsTab_ContractorSurnameColumn
source: Surname
pl_pl: Nazwisko

# ContractorsTab_PhoneNumberColumn
source: Phone number
pl_pl: Numer telefonu
