Repository: Gallileusz/CarRepairShop
Catalog: CarRepairShopTexts/SharedResources/texts.*.resx
Languages: pl_pl

# MainForm_MissingPermissionsToOpenTab
source: Missing permissions to display the {0} tab!
pl_pl: Nie masz uprawnień do wyświetlania zakładki: {0}!

# MainForm_Services
source: Services
pl_pl: Usługi

# MainForm_Users
source: Users
pl_pl: Użytkownicy

# MainForm_Warehouse
source: Warehouse
pl_pl: Magazyn

# MainForm_Contractors
source: Contractors
pl_pl: Kontrahenci

# UsersTab_PleaseSelectPersonToEdit
source: Please select a user to edit.
pl_pl: Proszę wybrać użytkownika do edycji.

# UsersTab_UsersPermissions
source: User permissions from:
pl_pl: Uprawnienia użytkownika:

# UsersTab_UserHasBeenAdded
source: User {0} {1} has been added.
pl_pl: Użytkownik {0} {1} został dodany.

# UsersTab_UserAddingError
source: An error accured while inserting new user!
pl_pl: Wystąpił błąd podczas dodawania nowego użytkownika!

# UsersTab_UserHasBeenEdited
source: User data has been updated.
pl_pl: Dane użytkownika zostały zaktualizowane.

# UsersTab_UserEditError
source: An error accured while editing selected user!
pl_pl: Wystąpił błąd podczas edytowania wybranego użytkownika!

# UsersTab_AskToDeleteBody
source: Do you really want to delete the user: {0} {1}?
pl_pl: Czy na pewno chcesz usunąć użytkownika: {0} {1}?

# UsersTab_UserHasBeenDeleted
source: User has been deleted.
pl_pl: Użytkownik został usunięty.

# UsersTab_UserDeleteError
source: An error accured while deleting selected user!
pl_pl: Wystąpił błąd podczas usuwania wybranego użytkownika!

# UsersTab_FirstNameAndSurnameCannotBeEmpty
source: The field firstname and lastname can't be empty!
pl_pl: Pole imie i nazwisko musi zostać wypełnione!

# UsersTab_UserExists
source: User with this firstname and lastname exists already!
pl_pl: Użytkownik o takim imieniu i nazwisku już istnieje!

# UsersTab_MissingPermissions
source: Missing permissions to edit in this tab! Please contact someone with edit permissions in users tab to assign new permissions for you!
pl_pl: Brak uprawnień do dokonywania zmian w tej zakładce! Skontaktuj się z kimś, kto ma uprawnienia edycji w zakładce użytkownicy, aby mógł ci nadać uprawnienia!

# UsersTab_CouldntAddPermissions
source: Permission assignement failed!
pl_pl: Nie udało się przypisać uprawnień do użytkownika!

# UsersTab_AskToDeleteHeader
source: Deleting user
pl_pl: Usuwanie użytkownika

# UsersTab_PleaseSelectPersonToDelete
source: Please select a user to delete.
pl_pl: Proszę wybrać użytkownika do usunięcia.

# UsersTab_ColumnName
source: Name
pl_pl: Imię

# UsersTab_ColumnSurname
source: Surname
pl_pl: Nazwisko

# PermissionsForm_ChangesSaved
source: Changes has been saved.
pl_pl: Zmiany zostały zapisane.

# PermissionsForm_AskToSaveBody
source: Do you want to save changes?
pl_pl: Chcesz zapisać zmiany?

# PermissionsForm_AskToSaveTitle
source: Permissions change confirmation
pl_pl: Potwierdzenie zmian uprawnień

# PermissionsForm_DatagridviewColumnAllowEdit
source: Edit
pl_pl: Edycja

# PermissionsForm_DatagridviewColumnAllowDisplay
source: Display
pl_pl: Wyświetlanie

# PermissionsForm_DatagridviewColumnPermissionTab
source: Tab
pl_pl: Zakładka

# PermissionsForm_PermissionContractors
source: Contractors
pl_pl: Kontrahenci

# PermissionsForm_PermissionServices
source: Services
pl_pl: Usługi

# PermissionsForm_PermissionSettings
source: Settings
pl_pl: Ustawienia

# PermissionsForm_PermissionStatistics
source: Statistics
pl_pl: Statystyka

# PermissionsForm_PermissionUsers
source: Users
pl_pl: Użytkownicy

# PermissionsForm_PermissionWarehouse
source: Warehouse
pl_pl: Magazyn

# UsersTab_UserCredentialsDataCannotBeEmpty
source: Login and Password field cannot be empty!
pl_pl: Pole login oraz hasło nie może być puste!

# UsersTab_LoginAlreadyInUse
source: Provided login is already in use!
pl_pl: Podany login jest już w użyciu!

# UsersTab_UserInfoTitle
source: User {0} {1}
pl_pl: Użytkownik {0} {1}

# LoginForm_LoggedOutFromAzureService
source: An error occurred while retrieving the database key from the Azure service. Please contact the administrator!
pl_pl: Wystąpił błąd z uzyskaniem klucza bazy danych z serwisu Azure. Proszę skontaktować się z administratorem!

# LoginForm_DatabaseNeedsToRestart
source: The database requires a restart. Please wait 30 to 60 seconds and try again.
pl_pl: Baza danych wymaga ponownego uruchomienia. Proszę odczekać od 30 do 60 sekund i spróbować ponownie.

# LoginForm_ProvideLoginAndPassword
source: Please enter your login and password.
pl_pl: Proszę wprowadzić login i hasło.

# LoginForm_InvalidCredentials
source: Invalid login or password.
pl_pl: Nieprawidłowy login lub hasło.

# LoginForm_FollowingErrorsOccurred
source: The following errors occurred:
pl_pl: Wystąpiły następujące błędy:

# WarehouseTab_All
source: All
pl_pl: Wszystkie

# WatehouseTab_AddConsuambleMaterial
source: Add new consumable material
pl_pl: Dodaj nowy materiał zużywalny

# WarehouseTab_MaterialAddedSuccessfully
source: Added new consumable material successfully.
pl_pl: Udało się dodać nowy materiał zużywalny.

# WarehouseTab_InsertingMaterialError
source: A new consumable material couldn't be added to the database!
pl_pl: Nie udało się dodać nowego materiału zużywalnego do bazy danych!

# WarehouseTab_MaterialEdit
source: Material edit {0}
pl_pl: Edycja materiału {0}

# WarehouseTab_MaterialUpdatedSuccessfully
source: Edited consumable material successfully.
pl_pl: Udało się dokonać zmian w materiale zużywalnym.

# WarehouseTab_MaterialUpdateError
source: The consumable material couldn't be updated!
pl_pl: Nie udało się dokonać zmian w materiale zużywalnym!

# WarehouseTab_DeleteMaterialBody
source: Do you really want to delete the consuamble material:
pl_pl: Czy na pewno chcesz usunąć materiał zużywalny:

# WarehouseTab_DeleteMaterialHeader
source: Removal confirmation
pl_pl: Potwierdzenie operacji usunięcia

# WarehouseTab_DeletedSuccessfully
source: Material deleted.
pl_pl: Materiał usunięty.

# WarehouseTab_DeleteError
source: Material couldn't be deleted!
pl_pl: Nie udało się usunąć materiału!

# ConsumableMaterial_ProvideNewMaterialsName
source: Provide new materails type name:
pl_pl: Podaj nazwę nowego typu materiału:

# ConsumableMaterial_MaterialInsertSuccess
source: Successfully added new material type.
pl_pl: Pomyślnie dodano nowy typ materiału.

# ConsumableMaterial_MaterialInsertError
source: Material type: {0} couldn't be added!
pl_pl: Nie udało się dodać typu materiału: {0}!

# ConsuambleMaterial_NameCannotBeEmpty
source: Name can't be empty!
pl_pl: Nazwa nie może być pusta!

# ConsumableMaterial_SelectMaterialType
source: Please select the material type!
pl_pl: Proszę wybrać typ materiału!

# ConsumableMaterial_ProvideMaterialName
source: Please provide the material name!
pl_pl: Proszę wprowadzić nazwę materiału!

# ConsumableMaterial_CorrectMaterialQuantity
source: The quanitity must be greater than 0!
pl_pl: Ilość musi być większa od 0!

# ConsumableMaterial_MaterialExistsAlready
source: Material type: {0} exists already!
pl_pl: Typ materiału: {0} już istnieje!

# MaterialsTypesList_AddNewMaterialType
source: Add new material type:
pl_pl: Dodaj nowy typ materiału:

# MaterialsTypesList_InsertSuccess
source: The material type: {0} has been successfully added.
pl_pl: Nowy typ materiału: {0} został pomyślnie dodany.

# MaterialsTypesList_InsertError
source: The material type: {0} couldn't be added!
pl_pl: Nie udało się dodać nowego materiału o nazwie: {0}!

# MaterialsTypesList_EditMaterial
source: Edit material type name:
pl_pl: Edytuj nazwę typu materiału:

# MaterialsTypesList_EditMaterialConfirmationBody
source: Do you really want to change the material type name from {0} to {1}?
pl_pl: Czy na pewno chcesz zmienić nazwę typu matateriału z {0} na {1}?

# MaterialsTypesList_EditMaterialConfirmationTitle
source: Name change
pl_pl: Zmiana nazwy

# MaterialsTypesList_EditSuccess
source: Material type name has been updated.
pl_pl: Nazwa typu materiału została zaktualizowana.

# MaterialsTypesList_EditError
source: Material type name couldn't been updated!
pl_pl: Nie udało się zmienić nazwy typu materiału!

# MaterialsTypesList_DeleteConfirmationBody
source: Do you really want to delete the material type: {0}?
pl_pl: Czy na pewno chcesz usunąć typ matateriału: {0}?

# MaterialsTypesList_DeleteConfirmationTitle
source: Delete confirmation
pl_pl: Potwierdzenie usunięcia

# MaterialsTypesList_DeleteSuccess
source: Material type {0} has been deleted.
pl_pl: Typ materiału {0} został usunięty.

# MaterialsTypesList_DeleteError
source: Material type: {0} couldn't be deleted!
pl_pl: Nie udało się usunąć typu materiału: {0}!

# WarehouseTab_DataGridViewColumnMaterialName
source: Material name
pl_pl: Nazwa materiału

# WarehouseTab_DataGridViewColumnMaterialTypeName
source: Material type name
pl_pl: Nazwa typu materiału

# WarehouseTab_DataGridViewColumnQuantity
source: Quantity
pl_pl: Ilość

# ServicesTab_MissingEditPermissions
source: Missing edit permissions for edit tab!
pl_pl: Nie masz uprawnień do zmiany statusu usług!

# ServicesTab_PleaseSelectService
source: Please select a services first.
pl_pl: Proszę najpierw wybrać usługę.

# ServicesTab_ConfirmServiceStatusChangeBody
source: Do you really want to change service: {0} status?
pl_pl: Czy na pewno chcesz zmienić status usługi: {0}?

# ServicesTab_ConfirmServiceStatusChangeTitle
source: Status change confirmation.
pl_pl: Potwierdzenie zmiany statusu usługi.

# ServicesTab_Active
source: active
pl_pl: aktywny

# ServicesTab_Inactive
source: inaktive
pl_pl: nieaktywny

# ServicesTab_StatusChangeSuccess
source: Successfully update service: {0} status to: {1}.
pl_pl: Pomyślnie zaktualizowano status usługi: {0} na {1}.

# ServicesTab_StatusChangeError
source: Service: {0} status couldn't be changed!
pl_pl: Nie udało się zaktualizować statusu usługi: {0}!

# ServicesTab_InsertSuccess
source: Successfully added new service.
pl_pl: Pomyślnie dodano nową usługę.

# ServicesTab_InsertError
source: New service couldn't be added!
pl_pl: Nie udało się dodać nowej usługi!

# ServicesTab_UpdateSuccess
source: Successfully updated the service.
pl_pl: Pomyślnie zaktualizowano usługę.

# ServicesTab_UpdateError
source: Service: {0} couldn't be edited!
pl_pl: Nie udało się zaktualiuzować usługi: {0}!

# ServicesTab_DeleteConfirmBody
source: Do you really want to delete the service: {0}?
pl_pl: Czy na pewno chcesz usunąć usługę: {0}?

# ServicesTab_DeleteConfirmTitle
source: Delete confirmation.
pl_pl: Potwierdzenie usunięcia usługi.

# ServicesTab_DeleteSuccess
source: Successfully deleted service.
pl_pl: Pomyślnie usunięto usługę.

# ServicesTab_DeleteError
source: Service couldn't be deleted!
pl_pl: Nie udało się usunąć usługi!

# ServicesForm_NewServiceTitle
source: Add new service
pl_pl: Dodaj nową usługę

# ServicesForm_EditServiceTitle
source: Edit service: {0}
pl_pl: Edycja usługi: {0}

# ServicesForm_PleaseProvideServiceName
source: Service name can't be empty!
pl_pl: Nazwa usługi nie może być pusta!

# ServicesForm_PleaseProvideServiceWarrantyTime
source: Warranty time can't be less than 0 months!
pl_pl: Gwarancja nie może być mniejsza niż 0 miesięcy!

# ServicesForm_PleaseProvideServiceDurationTime
source: Service duration time can't be less than 1 hour!
pl_pl: Czas wykonania usługi nie może być mniejszy niż 0 godzin!

# ServicesForm_PleaseProvideServicePrice
source: Please provide service price!
pl_pl: Proszę podać cenę usługi!

# ServicesForm_ServiceWithThisNameExistsAlready
source: Service with this name exists already!
pl_pl: Usługa z tą nazwą już istnieje!

# ServicesTab_StatusHeaderText
source: Active
pl_pl: Aktywny

# ServicesTab_NameHeaderText
source: Name
pl_pl: Nazwa

# ServicesTab_DurationHeaderText
source: Estimated execution time [hours]
pl_pl: Szacowany czas wykonania [godziny]

# ServicesTab_WarrantyHeaderText
source: Warranty [months]
pl_pl: Gwarancja [miesiące]

# ServicesTab_CostHeaderText
source: Cost
pl_pl: Koszt

# SettingsTab_SelectLanguage
source: Select language:
pl_pl: Wybierz język:

# SettingsTab_LanguageChangeConfirmationBody
source: The change of the language will restart the app! Do you want to change the language?
pl_pl: Zmiana języka spowoduje zresetowanie aplikacji! Czy chcesz zmienić język?

# SettingsTab_LanguageChangeConfirmationTitle
source: Language change confirmation.
pl_pl: Potwierdzenie zmiany języka.

# SettingsTab_ProvideNewPassword
source: Provide new password:
pl_pl: Podaj nowe hasło:

# SettingsTab_PasswordChangeConfirmationBody
source: Do you really want to change your password?
pl_pl: Czy na pewno chcesz zmienić swoje hasło?

# SettingsTab_PasswordChangeConfirmationTitle
source: Password change confirmation.
pl_pl: Potwierdzenie zmiany hasła.

# SettingsTab_PasswordChangeSuccess
source: Your password has been changed.
pl_pl: Twoje hasło zostało zmienione.

# SettingsTab_PasswordChangeError
source: Your password couldn't be changed!
pl_pl: Nie udało się zmienić twojego hasła!

# SettingsTab_PasswordCannotBeEmpty
source: The password can't be empty!
pl_pl: Hasło nie może być puste!

# SettingsTab_ProvidedPasswordIsTooShort
source: The password is too short! It has to contain at least 5 characters!
pl_pl: Hasło jest za krótkie! Musi zawierać przynajmniej 5 znaków!

# SettingsTab_ProvidedCurrentPasswordOnPasswordChange
source: The provided password to change is the same as the actual password!
pl_pl: Podane hasło jest to samo, co aktualne!

# CRMTab_TaskInsertFailed
source: Task creation has failed!
pl_pl: Nie udało się stworzyć zadania!

# CRMTab_TaskMappingsInsertFailed
source: Task services mapping failed!
pl_pl: Nie udało się dodać powiązań usług do zadania!

# CRMTab_TaskInsertSuccess
source: Successfully added new task.
pl_pl: Pomyślnie dodano nowe zadanie.

# CRMTab_ReadOnlyViewBody
source: This task is already closed. Do you want to open it in read-only mode?
pl_pl: To zadanie zostało już zamknięte. Czy chcesz je otworzyć w trybie bez edycji?

# CRMTab_ReadOnlyViewTitle
source: Task completed.
pl_pl: Zadanie zamknięte.

# CRMTab_UpdateSuccess
source: Successfully updated the task data.
pl_pl: Pomyślnie zaktualizowano dane zadania.

# CRMTab_UpdateError
source: Task data couldn't be updated!
pl_pl: Nie udało się zaktualizować danych zadania!

# CRMTab_MissingSuperAdminPermissions
source: You need to have Super-Admin rights for this action!
pl_pl: Potrzebujesz uprawnień super administratora do wykonania tej akcji!

# CRMTab_DeleteConfirmOperationBody
source: Do you really want to delete the selected task?
pl_pl: Czy na prawdę chcesz usunąć wybrane zadanie?

# CRMTab_DeleteConfirmOperationTitle
source: Operation confirmation.
pl_pl: Potwierdzenie operacji.

# CRMTab_DeleteTaskError
source: Task deletion has failed!
pl_pl: Nie udało się usunąć wybranego zadania!

# CRMTab_DeleteTaskMappingsError
source: Task service mappings deletion has failed!
pl_pl: Nie udało się usunąć powiązań usług wybranego zadania!

# CRMTab_DeleteSuccess
source: Successfully deleted the selected task.
pl_pl: Pomyślnie usunięto zadanie.

# CRMTab_ColumnMechanicFullName
source: Task created by
pl_pl: Zadanie utworzone przez

# CRMTab_ColumnContractorFullName
source: Contractor
pl_pl: Kontrahent

# CRMTab_ColumnDescription
source: Description
pl_pl: Opis

# CRMTab_ColumnVehicleData
source: Vehicle details
pl_pl: Dane samochodu

# CRMTab_ColumnServices
source: Services
pl_pl: Usługi

# CRMTab_ColumnStartDate
source: Creation date
pl_pl: Data utworzenia

# CRMTab_ColumnCloseDate
source: Close date
pl_pl: Data zamknięcia

# CRMTab_ColumnPrice
source: Price
pl_pl: Cena

# CRMTab_ColumnCompleted
source: Completed
pl_pl: Ukończone

# CRMForm_ConfirmClosureBody
source: Do you want to change the task status to closed?
pl_pl: Czy chcesz zmienić status zadania na zamknięty?

# CRMForm_ConfirmClosureTitle
source: Confirm operation.
pl_pl: Potwierdzenie operacji.

# CRMForm_ConfirmReOpenTitle
source: Confirm operation.
pl_pl: Potwierdzenie operacji.

# CRMForm_ConfirmReOpenBody
source: Do you want to reopen this task?
pl_pl: Czy chcesz zmienić status zadania na otwarty?

# CRMForm_SelectContractor
source: Please select a contractor.
pl_pl: Proszę wybrać kontrahenta.

# CRMForm_Error
source: Error!
pl_pl: Błąd!

# CRMForm_SelectVehicle
source: Please select a vehicle.
pl_pl: Proszę wybrać samochód.

# CRMForm_SelectService
source: Please select at least one service.
pl_pl: Proszę wybrać co najmniej jedną usługę.

# CRMForm_EmptyComment
source: Do you want to leave the comment empty?
pl_pl: Czy chcesz zostawić pole komentarza puste?

# CRMForm_Warning
source: Warning.
pl_pl: Ostrzeżenie.

# CRMForm_Yes
source: Yes
pl_pl: Tak

# CRMForm_No
source: No
pl_pl: Nie

# CRMForm_QuantityColumn
source: Quantity
pl_pl: Ilość

# CRMForm_NameColumn
source: Name
pl_pl: Nazwa

# CRMForm_PriceColumn
source: Price
pl_pl: Cena

# CRMForm_ProductionYear
source: Production year
pl_pl: Rok produkcji

# CRMForm_MileageColumn
source: Mileage
pl_pl: Przebieg

# CRMForm_LicensePlateColumn
source: License plate
pl_pl: Tablica rejestracyjna

# CRMForm_FuelTypeColumn
source: Fuel type
pl_pl: Typ paliwa

# CRMForm_EngineCapacityColumn
source: Engine capacity
pl_pl: Pojemność silnika

# CRMForm_BrandColumn
source: Brand
pl_pl: Marka

# ContractorForm_FillName
source: Fill the name field!
pl_pl: Uzupełnij pole imię!

# ContractorForm_FillSurname
source: Fill the surname field!
pl_pl: Uzupełnij pole nazwisko!

# ContractorForm_FillPhoneNumber
source: Fill the phone number field!
pl_pl: Uzupełnij pole numer telefonu!

# ContractorForm_IncorrectPhoneNumber
source: The phone number should contain at least 9 numbers!
pl_pl: Numer telefonu powinien mieć przynajmniej 9 cyfr!

# ContractorForm_FillEmail
source: Fill the e-mail field!
pl_pl: Uzupełnij pole email!

# ContractorForm_IncorrectEmail
source: Incorrect e-mail format!
pl_pl: Niepoprawny format adresu email!

# CarForm_FillBrand
source: Fill the brand field!
pl_pl: Uzupełnij pole: marka!

# CarForm_FillModel
source: Fill the model field!
pl_pl: Uzupełnij pole: model!

# CarForm_FillProductionYear
source: Fill the production year field!
pl_pl: Uzupełnij pole: rok produkcji!

# CarForm_FillVIN
source: Fill the VIN field!
pl_pl: Uzupełnij pole: VIN!

# CarForm_FillLicensePlate
source: Fill the license plate field!
pl_pl: Uzupełnij pole: tablica rejestracyjna!

# CarForm_FillEngineCapacity
source: Fill the engine capacity field!
pl_pl: Uzupełnij pole: pojemność silnika!

# CarForm_FillMileage
source: Fill the mileage field!
pl_pl: Uzupełnij pole: przebieg!

# CarForm_SelectFuelType
source: Select the fuel type!
pl_pl: Proszę wybrać typ paliwa!

# FuelTypesList_AddNewFuelType
source: Add new fuel type
pl_pl: Dodaj nowy typ paliwa

# FuelTypesList_InsertSuccess
source: Successfully added new fuel type: {0}.
pl_pl: Pomyślnie dodano nowy typ paliwa: {0}.

# FuelTypesList_InsertFailed
source: The fuel type: {0} couldn't be added!
pl_pl: Nie udało się dodać typu paliwa: {0}!

# FuelTypesList_EditSuccess
source: Successfully edited the fuel type name.
pl_pl: Pomyślnie zmieniono nazwę typu paliwa.

# FuelTypesList_EditFuelType
source: Edit fuel type name
pl_pl: Edycja nazwy typu paliwa

# FuelTypesList_EditFailed
source: The fuel type name couldn't be changed!
pl_pl: Nie udało się zmienić nazwy typu paliwa!

# FuelTypesList_EditConfirmationTitle
source: Edit confirmation
pl_pl: Potwierdź edycję

# FuelTypesList_EditConfirmationBody
source: Do you really want to change the fuel type name from {0} to {1}?
pl_pl: Czy chcesz zmienić nazwę typu paliwa z {0} na {1}?

# FuelTypesList_DeleteSuccess
source: Successfully deleted fuel type: {0}.
pl_pl: Pomyślnie usunięto typu paliwa: {0}.

# FuelTypesList_DeleteFailed
source: The fuel type: {0} couldn't be deleted!
pl_pl: Nie udało się usunąć typu paliwa: {0}!

# FuelTypesList_DeleteConfirmationBody
source: Do you really want to delete the fuel type: {0}?
pl_pl: Czy na pewno chcesz usunąć typ paliwa: {0}?

# FuelTypesList_DeleteConfirmationTitle
source: Delete confirmation.
pl_pl: Potwierdzenie usunięcia.

# FuelTypesList_Name
source: Name
pl_pl: Nazwa

# ContractorTab_ContractorsCarExistsError
source: Selected contractor already has this car assigned. Operation cancelled!
pl_pl: Wybrany kontrahent posiada już taki przypisany samochód. Operacja przerwana!

# ContractorTab_ContractorExistsError
source: Contractor exists already. Operation cancelled!
pl_pl: Taki kontrahent już istnieje. Operacja przerwana!

# ContractorTab_AddNewContractor
source: Add new contractor
pl_pl: Dodaj nowego kontrahenta

# ContractorTab_AddNewCar
source: Add new car for {0} {1}
pl_pl: Dodaj nowy samochód dla {0} {1}

# ContractorTab_CarInsertError
source: The car couldn't be added!
pl_pl: Nie udało się dodać nowego samochodu dla wybranego kontrahenta!

# ContractorTab_CarInsertSuccess
source: Successfully added new car for selected contractor.
pl_pl: Udało się dodać nowy samochód dla wybranego kontrahenta.

# ContractorTab_ContractorInsertError
source: The contractor couldn't be added!
pl_pl: Nie udało się dodać nowego kontrahenta!

# ContractorTab_ContractorInsertSuccess
source: Successfully added new contractor.
pl_pl: Pomyślnie dodano nowego kontrahenta.

# ContractorTab_DeleteCarConfirmationBody
source: Do you really want to delete the car: {0} {1}? The operation won't be able to recover!
pl_pl: Czy na pewno chcesz usunąć samochód: {0} {1}? Operacja jest nieodwracalna!

# ContractorTab_DeleteCarConfirmationTitle
source: Delete confirmation.
pl_pl: Potwierdzenie usunięcia.

# ContractorTab_DeleteCarError
source: Selected car couldn't be deleted!
pl_pl: Nie udało się usunąć wybranego samochodu!

# ContractorTab_DeleteCarSuccess
source: Successfully deleted the selected car.
pl_pl: Udało się usunąć wybrany samochód.

# ContractorTab_DeleteContractorConfirmationBody
source: Do you really want to delete the contractor: {0} {1} and all cars assigned to the contractor? Do you really want to delete the car: {0} {1}? The operation won't be able to recover!
pl_pl: Czy na pewno chcesz usunąć kontrahenta: {0} {1} i wszystkie jego samochody? Operacja jest nieodwracalna!

# ContractorTab_DeleteContractorConfirmationTitle
source: Delete confirmation.
pl_pl: Potwierdzenie usunięcia.

# ContractorTab_DeleteContractorsCarsError
source: Contractors cars couldn't be deleted. Operation cancelled!
pl_pl: Problem z usunięciem samochodów kontrahenta. Operacja została przerwana!

# ContractorTab_DeleteContractorError
source: Contractor couldn't be deleted!
pl_pl: Nie udało się usunąć kontrahenta!

# ContractorTab_DeleteContractorSuccess
source: Successfully deleted selected contracor.
pl_pl: Udało się usunąć kontrahenta.

# ContractorTab_EditCar
source: Edit car {0} {1}
pl_pl: Edytuj samochód {0} {1}

# ContractorTab_EditCarError
source: Contractors car data couldn't be updated!
pl_pl: Nie udało się zaktualizować danych samochodu dla wybranego kontrahenta!

# ContractorTab_EditCarSuccess
source: Contractors car data has been updated.
pl_pl: Udało się zaktualizować dane samochodu dla wybranego kontrahenta.

# ContractorTab_EditContractor
source: Edit contractor: {0} {1}
pl_pl: Edycja kontrahenta: {0} {1}

# ContractorTab_EditContractorError
source: Contractor couldn't be updated!
pl_pl: Nie udało się zaktualizować kontrahenta!

# ContractorTab_EditContractorSuccess
source: Contractors data has been updated.
pl_pl: Udało się zaktualizować dane kontrahenta.

# FuelTypesList_FuelTypeInUseError
source: Selected fuel type: {0} is assigned to contractor cars. Operation cancelled!
pl_pl: Wybrany typ paliwa: {0} jest przypisany do somochodów kontrahenta. Operacja przerwana!

# ContractorTab_CarHasTaskMappings
source: Selected car has task mappings! Operation cancelled!
pl_pl: Do wybranego samochodu są przypisane zadania CRM! Operacja przerwana!
